package com.company.mivafox;

//  Создать классы Собака и Кот с наследованием от класса Животное.
public abstract class Animal
{
    // У каждого животного есть ограничения на действия (бег: кот 200 м., собака 500 м.; прыжок: кот 2 м., собака 0.5 м.; плавание: кот не умеет плавать, собака 10 м.).
    protected float maxRunLength;
    protected float maxSwimLength;
    protected float maxJumpHeight;

    public Animal(float maxRunLength, float maxSwimLength, float maxJumpHeight)
    {
        this.maxRunLength = maxRunLength;
        this.maxSwimLength = maxSwimLength;
        this.maxJumpHeight = maxJumpHeight;
    }

    // Животные могут выполнять действия: бежать, плыть, перепрыгивать препятствие. В качестве параметра каждому методу передается величина, означающая или длину препятствия (для бега и плавания), или высоту (для прыжков).
    // При попытке животного выполнить одно из этих действий, оно должно сообщить результат в консоль. (Например, dog1.run(150); -> результат: run: true)

    public void run(float length)
    {
        System.out.println("run: " + isAvailableAction(length, maxRunLength));
    }

    public void swim(float length)
    {
        System.out.println("swim: " + isAvailableAction(length, maxSwimLength));
    }

    public void jump(float height)
    {
        System.out.println("jump: " + isAvailableAction(height, maxJumpHeight));
    }

    private boolean isAvailableAction(float required, float expected)
    {
        return required <= expected;
    }
}
